rafaelwanner/ES_with_Drones/LAB_complete_v3/ST_Drone_FCU_F401/STM32 FW Project/Official release - 170120/Src/main.c
/*
	while(1){
		if (HAL_GetTick() > ToF_timeout){
			//distance in centimeters
			ToF_cm =  BSP_ToF_Get_Distance();
			PRINTF("Distance: %d\n", ToF_cm);
			//next time
			ToF_timeout = HAL_GetTick() + 1000;
		}
	}
*/
	actual = 0;
	reference = 0;
	pid_thr_integ = 0;

	/* USER CODE END 2 */



	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1)
	{
		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */
		if(HCI_ProcessEvent) {
			HCI_ProcessEvent=0;
			HCI_Process();
		}

		if(set_connectable){
			/* Now update the BLE advertize data and make the Board connectable */
			setConnectable();
			set_connectable = FALSE;
		}

/*		// 10 Hz readings
		if (HAL_GetTick() > ToF_timeout){
			//distance in centimeters
			ToF_cm =  BSP_ToF_Get_Distance();
			//next time
			ToF_timeout = HAL_GetTick() + 100;
		}
*/

		if (tim9_event_flag == 1)
		{     // Timer9 event: frequency 800Hz
			tim9_event_flag = 0;

			count1++;

			acc_ahrs.AXIS_X = 0;
			acc_ahrs.AXIS_Y = 0;
			acc_ahrs.AXIS_Z = 0;
			gyro_ahrs.AXIS_X = 0;
			gyro_ahrs.AXIS_Y = 0;
			gyro_ahrs.AXIS_Z = 0;

			for(i=0;i<FIFO_Order;i++)
			{
				acc_ahrs.AXIS_X += acc_ahrs_FIFO[i].AXIS_X;
				acc_ahrs.AXIS_Y += acc_ahrs_FIFO[i].AXIS_Y;
				acc_ahrs.AXIS_Z += acc_ahrs_FIFO[i].AXIS_Z;
				gyro_ahrs.AXIS_X += gyro_ahrs_FIFO[i].AXIS_X;
				gyro_ahrs.AXIS_Y += gyro_ahrs_FIFO[i].AXIS_Y;
				gyro_ahrs.AXIS_Z += gyro_ahrs_FIFO[i].AXIS_Z;
			}

			acc_ahrs.AXIS_X *=FIFO_Order_Recip;
			acc_ahrs.AXIS_Y *=FIFO_Order_Recip;
			acc_ahrs.AXIS_Z *=FIFO_Order_Recip;
			gyro_ahrs.AXIS_X *=FIFO_Order_Recip;
			gyro_ahrs.AXIS_Y *=FIFO_Order_Recip;
			gyro_ahrs.AXIS_Z *=FIFO_Order_Recip;


			acc_fil_int.AXIS_X = (int32_t) acc_ahrs.AXIS_X;
			acc_fil_int.AXIS_Y = (int32_t) acc_ahrs.AXIS_Y;
			acc_fil_int.AXIS_Z = (int32_t) acc_ahrs.AXIS_Z;
			gyro_fil_int.AXIS_X = (int32_t) gyro_ahrs.AXIS_X;
			gyro_fil_int.AXIS_Y = (int32_t) gyro_ahrs.AXIS_Y;
			gyro_fil_int.AXIS_Z = (int32_t) gyro_ahrs.AXIS_Z;


			//PRINTF("%f %f %f %f\n", acc_ahrs.AXIS_X, acc_ahrs.AXIS_Y, gyro_ahrs.AXIS_X, gyro_ahrs.AXIS_Y);

			// AHRS update, quaternion & true gyro data are stored in ahrs
			ahrs_fusion_ag(&acc_ahrs, &gyro_ahrs, &ahrs);

			// Calculate euler angle drone
			QuaternionToEuler(&ahrs.q, &euler_ahrs);

			//BSP_LED_Toggle(LED1);

#ifdef REMOCON_BLE


			//          gRUD = (joydata[3]-128)*(-13);
			//          gTHR = joydata[4]*13;
			//          gAIL = (joydata[5]-128)*(-13);
			//          gELE = (joydata[6]-128)*13;
			gRUD = (joydata[2]-128)*(-13);
			gTHR = joydata[3]*13;
			gAIL = (joydata[4]-128)*(-7);
			gELE = (joydata[5]-128)*7;

			//PRINTF("Throttle: %d\n", gTHR);

			/* joydata[6]: seek bar data*/
			/* joydata[7]: additional button data
                        first bit: Takeoff (0 = Land,  1 = Takeoff)
                        second bit: Calibration When it changes status is active
                        third bit: Arming (0 = Disarmed,  1 = Armed) */
			gJoystick_status = joydata[7];
			if ((gJoystick_status&0x04)==0x04){
				rc_enable_motor = 1;
				fly_ready = 1;
				BSP_LED_On(LED2);
			}
			else {
				rc_enable_motor = 0;
				fly_ready = 0;
			}


			if (connected){
				rc_connection_flag = 1;                       /* BLE Remocon connected flag for enabling motor output */
				SendMotionData();
				SendBattEnvData();
				SendArmingData();
			}
			else{
				rc_connection_flag = 0;
				gTHR=0;
				rc_enable_motor = 0;
				fly_ready = 0;
				BSP_LED_Off(LED1);
				BSP_LED_Off(LED2);
			}

			/* original calibration
			if (joydata[7]&0x02){
				rc_cal_flag = 1;
				BSP_LED_On(LED1);
			}
	*		*/

			/* calibrate sensors */
			/* only when disarmed */
			if ((fly_ready == 0) && (sensor_init_cali == 1)){
				if ( (gTHR == 0) && (gELE*13/7 < - RC_CAL_THRESHOLD) && (gAIL*13/7 > RC_CAL_THRESHOLD) && (gRUD < - RC_CAL_THRESHOLD))
				{
					//sensor_init_cali = 0;
					rc_cal_flag = 1;
					BSP_LED_On(LED1);
					first = 0x1;
					active = 0x0;
				}
			}

			if((joydata[7]&0x02)==0x02){
				hover_flag = hover_flag ^ 0x1;
				joydata[7] &= 0xFD;
			}

#endif

#ifdef REMOCON_PWM
			if ( (gTHR == 0) && (gELE < - RC_CAL_THRESHOLD) && (gAIL > RC_CAL_THRESHOLD) && (gRUD < - RC_CAL_THRESHOLD))
			{
				rc_cal_flag = 1;
				BSP_LED_On(LED1);
			}


			if ( (gTHR == 0) && (gELE < - RC_CAL_THRESHOLD) && (gAIL < - RC_CAL_THRESHOLD) && (gRUD > RC_CAL_THRESHOLD))
			{
				rc_enable_motor = 1;
				fly_ready = 1;
				BSP_LED_On(LED2);
			}
#endif


			// Get target euler angle from remote control
			GetTargetEulerAngle(&euler_rc, &euler_ahrs);
/*
			if (HAL_GetTick() > ToF_timeout){
				//distance in centimeters
				PRINTF("Hover Flag: %d\t\n", hover_flag);
				//next time
				ToF_timeout = HAL_GetTick() + 1000;
			}
*/

			if (hover_flag){
				if (HAL_GetTick() > ToF_timeout){
					active = 0x1;
					actual =  BSP_ToF_Get_Distance();

					//setting reference
					if (first){
						reference = 20;
						first = 0x0;
					}
					//PRINTF("Actual: %d,      Reference: %d\r\n", actual, reference);
					ToF_timeout = HAL_GetTick() + 500;
				}
			}
			else{
				active = 0x0;
			}
			//PRINTF("Hover flag: %d,       Distance active: %d\r\n", hover_flag, active);



			if(gTHR<MIN_THR)
			{
				euler_ahrs_offset.thx = 0;
				euler_ahrs_offset.thy = 0;
			}

			Fly_origin.X_Degree = (int16_t)(euler_ahrs.thx * 5730);
			Fly_origin.Y_Degree = (int16_t)(euler_ahrs.thy * 5730);
			Fly_origin.Z_Degree = (int16_t)(euler_ahrs.thz * 5730);


			if(gTHR<MIN_THR)
			{
				euler_rc.thz = 0;
				euler_ahrs.thz = 0;
			}

			euler_rc_fil.thx = euler_rc.thx;
			euler_rc_fil.thy = euler_rc.thy;
			euler_rc_fil.thz = euler_rc.thz;

			FlightControlPID_OuterLoop(&euler_rc_fil, &euler_ahrs, &ahrs, &pid);

			/* Added for debug on UART*/
			/* Remocon ELE, AIL, RUD, THR, AHRS Euler angle x and y axis, Remocon Euler angle x and y axis */
			//PRINTF("%d\t%d\t%d\t%d\t%f\t%f\t%f\t%f\n", gELE, gAIL, gRUD, gTHR, euler_ahrs.thx * 57.3f, euler_ahrs.thy * 57.3f, euler_rc.thx * 57.3f, euler_rc.thy * 57.3f);
			/* Remocon ELE, AIL, RUD, THR, Motor1_pwm, AHRS Euler angle x and y axis */
			//PRINTF("%d\t%d\t%d\t%d\t%f\t%f\t%f\t%f\t%f\n", gELE, gAIL, gRUD, gTHR, motor_pwm.motor1_pwm, euler_ahrs.thx * 57.3f, euler_ahrs.thy * 57.3f, euler_rc.thx * 57.3f, euler_rc.thy * 57.3f);
			//PRINTF("%d\t%d\t%d\t%d\n", gELE, gAIL, gRUD, gTHR);
			/* Remocon THR, Acc and Gyro FIFO data x and y axis, AHRS Euler angle x and y axis, Remocon Euler angle x and y axis*/
			//PRINTF("%d\t%f\t%f\t%f\t%f\t%f\t%f\t%f\t%f\n", gTHR, acc_ahrs.AXIS_X, acc_ahrs.AXIS_Y, gyro_ahrs.AXIS_X, gyro_ahrs.AXIS_Y, euler_ahrs.thx * 57.3f, euler_ahrs.thy * 57.3f, euler_rc.thx * 57.3f, euler_rc.thy * 57.3f);
			/* MEMS Accelerometer RAW data */
			//PRINTF("%d\t%d\t%d\t\n", acc.AXIS_X, acc.AXIS_Y, acc.AXIS_Z);

